source/Tasks/ZadachaPoKadrovomuIzmeneniyu.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ZadachaPoKadrovomuIzmeneniyu</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>KadrovoyeIzmenenie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OpisanieZadachi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

source/InformationRegisters/VKRQueue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRQueue</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Attempts</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NextTry</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimUntil</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastError</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/Enums/VKRQueueStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>VKRQueueStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Prepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retry</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/Tasks/ZadachaPoKadrovomuIzmeneniyu/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда
        Отказ = Истина;
        Сообщить("Прямая загрузка этого служебного объекта через обмен не поддерживается.");
        Возврат;
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(БизнесПроцесс) Тогда
        Отказ = Истина;
        Сообщить("Задача создаётся маршрутом контроля кадрового изменения.");
        Возврат;
    КонецЕсли;
    KadrovoyeIzmenenie = БизнесПроцесс.KadrovoyeIzmenenie;
КонецПроцедуры

Процедура ПередВыполнением(Отказ)
    Попытка
        Если НЕ ЗначениеЗаполнено(KadrovoyeIzmenenie) Тогда
            ВызватьИсключение "В задаче нет кадрового события.";
        КонецЕсли;
        Событие = KadrovoyeIzmenenie.ПолучитьОбъект();
        Если Событие.ПометкаУдаления Тогда
            ВызватьИсключение "Кадровое событие помечено на удаление.";
        КонецЕсли;
        Точки = БизнесПроцессы.ObrabotkaKadrovogoIzmeneniya.ТочкиМаршрута;
        ЭтапКадровика = ТочкаМаршрута = Точки.ProverkaKadrovikom
            Или ТочкаМаршрута = Точки.FormirovanieUvedomleniya;
        Если НЕ РольДоступна("Administrator") Тогда
            Если (ЭтапКадровика И НЕ РольДоступна("Kadrovik"))
                Или (НЕ ЭтапКадровика И НЕ РольДоступна("OperatorUvedomleniy")) Тогда
                ВызватьИсключение "У текущей роли нет права завершать этот этап маршрута.";
            КонецЕсли;
        КонецЕсли;
        Если ТочкаМаршрута = Точки.ProverkaKadrovikom Тогда
            VKRHR.ПроверитьСобытие(Событие);
            Если Событие.TrebuyetsyaUvedomleniye Тогда
                VKRRules.ПодготовитьПисьма(Событие);
            КонецЕсли;
        ИначеЕсли ТочкаМаршрута = Точки.FormirovanieUvedomleniya Тогда
            Событие.Записать(РежимЗаписиДокумента.Проведение);
        Иначе
            Если НЕ Событие.Проведен Тогда
                ВызватьИсключение "Кадровое событие не проведено.";
            КонецЕсли;
            ПроверитьОчередь(ТочкаМаршрута = Точки.PovtornayaOtpravka);
        КонецЕсли;
    Исключение
        Отказ = Истина;
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

Процедура ПроверитьОчередь(ТребоватьРазбораОшибок)
    Запрос = Новый Запрос("ВЫБРАТЬ О.State КАК Состояние
        |ИЗ РегистрСведений.VKRQueue КАК О ГДЕ О.Event = &Событие");
    Запрос.УстановитьПараметр("Событие", KadrovoyeIzmenenie);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        С = Выборка.Состояние;
        Если С = Перечисления.VKRQueueStates.Prepared
            Или С = Перечисления.VKRQueueStates.Retry
            Или С = Перечисления.VKRQueueStates.Sending Тогда
            ВызватьИсключение "Отправка ещё не закончена. Обработайте очередь в панели уведомлений.";
        КонецЕсли;
        Если ТребоватьРазбораОшибок И (С = Перечисления.VKRQueueStates.Unknown
            Или С = Перечисления.VKRQueueStates.Failed) Тогда
            ВызватьИсключение "Остались ошибки или неизвестный результат. Зафиксируйте решение оператора.";
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
